\page CPP-Intro C++ Einführung für Betriebssytembau

[TOC]

Dies ist bei weitem keine vollständige Einführung in C++, sondern
ausschließlich eine Behandlung einzelner Themenkomplexe, die für dieses Fach
von Bedeutung sind. Die Gebiete werden nicht nur in ihrer Verwendung
erläutert, sondern auch in ihrer technischen Auswirkung. Die einzelnen
Mechanismen sollen also entmystifiziert werden. Dies wird anhand von
C++ Codebeispielen, Terminaloutputs und Assemblerlistings geschehen.

Eine gute Quelle für ein umfassenderes C++ Tutorial ist
[cplusplus.com](http://www.cplusplus.com/doc/tutorial/).

# Objekt vs. Pointer vs. Referenz

Jede Variablen<b>definition</b> reserviert ein Stück Speicher und gibt
diesem Speicher einen Namen und einen Datentypen. Über den Namen kann
der Speicher im Programm angesprochen werden, der Datentyp gibt an wie
dieser zu interpretieren ist. Dazu wollen wir uns anschauen, was der
Compiler (`g++ -m32 -fno-PIE test.c -o test`) aus folgendem Stück Code
macht:

\code{.cpp}
int     ganzzahl;
double  fliesskomma;

int main(void) {
   ganzzahl    += 1;
   fliesskomma += 1;
   return 0;
}
\endcode

Zunächst können wir uns mit dem Tool `nm` ansehen, welche globalen
Objekte mit welchen Addressen und Größen angelegt wurden (`...` zeigt
eine Auslassung an):

```console
$ nm --numeric-sort -S test
...
0000052d 0000001b T main
...
00002020 00000008 B fliesskomma
00002028 00000004 B ganzzahl
...
```

Aus dieser Ausgabe sehen wir, dass die beiden Variablen im BSS Segment

dieser VTable ist ein Pointer auf den Funktionskörper von `Object::method()` gespeichert. Da der VTable-Pointer direkt vom dynamischen Typen abhängt, kann über diese Funktionstabelle der dynamische Dispatch durchgeführt werden. Für unseren Methodenaufruf sieht der dazu passende Assembler so aus (Object * in `%%eax`):

\code{.asm}
mov    (%eax),%edx   # VTable-Pointer in %edx
push   %eax          # this Pointer auf den Stack
call   *(%edx)       # Dereferenziere den VTable-Pointer ohne Offset (Slot 0)
                     # und mache einen indirekten Aufruf
\endcode

Jede virtuelle Methode, die wir definieren, bekommt also einen Slot in
der virtuellen Funktionstabelle. Um noch genauer zu betrachten, was
der Compiler in die VTable baut, können wir den Compiler mit `g++
-fdump-class-hierarchy` aufrufen und die Ausgabe betrachten:

```
Vtable for Object
Object::_ZTV6Object: 3 entries
0     (int (*)(...))0
4     (int (*)(...))(& _ZTI6Object)
8     (int (*)(...))Object::method

Class Object
   size=16 align=4
   base size=16 base align=4
Object (0x0x7f6b48574060) 0
    vptr=((& Object::_ZTV6Object) + 8)
```

Wir sehen aus der Ausgabe, dass die VTable eigentlich 8 Byte weiter
vorne anfängt als der vptr, der am Ende in unseren Objekten
gespeichert wird. Zusätzlich zu unseren Methodenpointern wird noch ein
Pointer auf die Run-Time-Type-Information (RTTI) gespeichert.

All dieses Wissen zusammengenommen können wir also auch mal ein
Object und die dazu passende VTable zusammenfaken:

\code{.cpp}
void my_method(Object *obj) {
    printf("X: %d %d %d\n", obj->a, obj->b, obj->c);
}

int main() {
    int vtable[] = {
        0, 0, 
        (int) &my_method
    };
    int memory[] = {
        (int) vtable + 8,
        1, 2, 3
    };
    Object *obj = (Object *)memory;
}
\endcode

Als Ausgabe erhalten wir für dieses Programm (für `-m32`, 32 Bit): `X: 1 2 3`.

Was wir aus dieser technischen Betrachtung von virtuellen Funktionstabellen lernen, ist:

- Der statische Dispatch ist umsonst.
- Der dynamische Dispatch ist ein indirekter Call über einen VTable Pointer.
- C++ zahlt diese Kosten nur, wenn die Funktionalität explizit gefordert wurde.

Links:

- [Wikipedia: Endianess](https://en.wikipedia.org/wiki/Endianness)
- [C++ vtables - Part 1](https://shaharmike.com/cpp/vtable-part1/)

# Vererbung auf technischer Ebene

Wir haben bereits gelernt, wie in C++ Verbundatentypen (struct, union,
class) im Speicher abgelegt werden. Bei einfache Datenstrukturen (POD)
werden die Felder (von oben nach unten) hintereinander in den Speicher
gelegt (von den niedrigen Adressen zu den hohen Adressen. Und wir
haben gelernt, wie Klassen die einen `virtual` Methode enthalten um
einen VTable Pointer erweitert werden.

Wie sieht es aber nun mit Vererbung aus? Dazu ein Beispiel, welches
wir mit `clang -Xclang -fdump-record-layouts` übersetzen:

\code{.cpp}
class Base {
    int a;
    int b;
};

class Derived : public Base {
    int cc;
};

int main() {
    Base x;
    Derived yy;
}
\endcode

Aus der Ausgabe bekommen wir heraus, dass die Base Klasse ganz regulär
in den Speicher abelegt wird. Hierbei ist die Linke Spalte der Offset
vom Pointer zum Objekt:

```
0 | class Base
0 |   int a
4 |   int b
  | [sizeof=8, dsize=8, align=4,
  |  nvsize=8, nvalign=4]
```

Die beiden Integer sind also einfach hintereinander in den Speicher
gelegt. Und wenn wir uns die Klasse Derived anschauen, dann sehen wir,
dass dieses Speicherabbild in den Anfang des Derived Objektes
eingebaut wird. Und dadurch der Pointer zur Variable `cc` einen Offset
von 8 Byte aufweist.

```
0 | class Derived
0 |   class Base (base)
0 |     int a
4 |     int b
8 |   int cc
  | [sizeof=12, dsize=12, align=4,
  |  nvsize=12, nvalign=4]
```

Der Trick bei dieser Art der Einbettung ist nun, dass man den Pointer
der auf ein Derived Objekt zeigt ohne Probleme wie ein Objekt vom
Typen Base verwenden kann. Denn alle Felder sind ja an der gleichen
Stelle. Die selben Regel gelten, wenn wir eine `virtual` Methode zur
Base hinzufügen. In dem Fall, kann jedes Derived Objekt das vtable
Pointer Feld der *primären* Basisklasse verwenden um auf den eigenen
vtable zu zeigen:

```
 0 | class Derived
 0 |   class Base (primary base)
 0 |     (Base vtable pointer)
 8 |     int a
12 |     int b
16 |   int cc
   | [sizeof=24, dsize=20, align=8,
   |  nvsize=20, nvalign=8]

```

Solange man nur Einfachvererbung hat ist dies im Grunde alles was es
über Memory Layouts von Klassen wissen muss. In dem Moment wo man
Mehrfachvererbung hat, wird das ganze eine Ecke komplizierter. Dazu
ein Beispiel **ohne virtual**:

\code{.cpp}
class Base {
    int a;
    int b;
};

class Base2 {
    int c;
    int d;
};

class Derived : public Base, public Base2 {
    int xx;
};
\endcode

Das Speicherlayout der abgeleiteten Klasse sieht dann folgendermassen aus:

```
 0 | class Derived
 0 |   class Base (base)
 0 |     int a
 4 |     int b
 8 |   class Base2 (base)
 8 |     int c
12 |     int d
16 |   int xx
   | [sizeof=20, dsize=20, align=4, nvsize=20, nvalign=4]
```

Auffällig ist, dass wiederum die Speicherlayouts der geerbten Klassen
1:1 in der Derived Klasse zu finden sind. Allerdings besteht nun das
Problem, dass wir den Pointer der auf den Anfang zeigt, nicht mehr
einfach verwenden können um eine Funktion zu füttern die ein `Base2`
Speicherlayout erwartet. In dem Fall muss also eine Anpassung des this
Pointers erfolgen. Um dies zu illustrieren, schauen wir uns den
Assembler der Funktion `Base2 * foo(Derived *x) {return x;}` an:

\code{.asm}
00000000 <_Z3fooP7Derived>:
   mov    0x4(%esp),%ecx   # Lade das erste Argument nach %ecx
   lea    0x8(%ecx),%eax   # %eax = %ecx + 8 (Offset zu Base2)
   test   %ecx,%ecx        # Teste ob %ecx == 0
   cmove  %ecx,%eax        # Falls ja, setze %eax auf 0
   ret                     # Return %eax
\endcode

Hier sehen wir, dass für die Konvertierung der beiden Pointer ein
Offset von 8 aufaddiert wird. Dies führt dazu, dass aus einen Derived
